let text1400 = 'Виправимо всі помилки, приберемо всі дурниці, перефразуємо невдалі місця, але сильно текст не переписуватимемо. Зайвих виправлень не буде. Виправимо всі помилки, приберемо всі дурниці, перефразуємо невдалі місця, але сильно текст не переписуватимемо. Зайвих виправлень не буде. Виправимо всі помилки, приберемо всі дурниці, перефразуємо невдалі місця, але сильно текст не переписуватимемо. Зайвих виправлень не буде. Виправимо всі помилки, приберемо всі дурниці, перефразуємо невдалі місця, але сильно текст не переписуватимемо. Зайвих виправлень не буде. Виправимо всі помилки, приберемо всі дурниці, перефразуємо невдалі місця, але сильно текст не переписуватимемо. Зайвих виправлень не буде. Виправимо всі помилки, приберемо всі дурниці, перефразуємо невдалі місця, але сильно текст не переписуватимемо. Зайвих виправлень не буде. Виправимо всі помилки, приберемо всі дурниці, перефразуємо невдалі місця, але сильно текст не переписуватимемо. Зайвих виправлень не буде. Виправимо всі помилки, приберемо всі дурниці, перефразуємо невдалі місця, але сильно текст не переписуватимемо. Зайвих виправлень не буде. Виправимо всі помилки, приберемо всі дурниці, перефразуємо невдалі місця, але сильно текст не переписуватимемо. Зайвих виправлень не буде. Виправимо всі помилки, приберемо всі дурниці, перефразуємо невдалі місця, але сильно текст не переписуватимемо. Зайвих виправлень не буде. jfsgjasdfg'
let text1300 = 'Виправимо всі помилки, приберемо всі дурниці, перефразуємо невдалі місця, але сильно текст не переписуватимемо. Зайвих виправлень не буде. Виправимо всі помилки, приберемо всі дурниці, перефразуємо невдалі місця, але сильно текст не переписуватимемо. Зайвих виправлень не буде. Виправимо всі помилки, приберемо всі дурниці, перефразуємо невдалі місця, але сильно текст не переписуватимемо. Зайвих виправлень не буде. Виправимо всі помилки, приберемо всі дурниці, перефразуємо невдалі місця, але сильно текст не переписуватимемо. Зайвих виправлень не буде. Виправимо всі помилки, приберемо всі дурниці, перефразуємо невдалі місця, але сильно текст не переписуватимемо. Зайвих виправлень не буде. Виправимо всі помилки, приберемо всі дурниці, перефразуємо невдалі місця, але сильно текст не переписуватимемо. Зайвих виправлень не буде. Виправимо всі помилки, приберемо всі дурниці, перефразуємо невдалі місця, але сильно текст не переписуватимемо. Зайвих виправлень не буде. Виправимо всі помилки, приберемо всі дурниці, перефразуємо невдалі місця, але сильно текст не переписуватимемо. Зайвих виправлень не буде. Виправимо всі помилки, приберемо всі дурниці, перефразуємо невдалі місця, але сильно текст не переписуватимемо. Зайвих виправлень не буде. Виправимо всі помилки, приберемо всі дурниці, пер'
let text1333 = 'Виправимо всі помилки, приберемо всі дурниці, перефразуємо невдалі місця, але сильно текст не переписуватимемо. Зайвих виправлень не буде. Виправимо всі помилки, приберемо всі дурниці, перефразуємо невдалі місця, але сильно текст не переписуватимемо. Зайвих виправлень не буде. Виправимо всі помилки, приберемо всі дурниці, перефразуємо невдалі місця, але сильно текст не переписуватимемо. Зайвих виправлень не буде. Виправимо всі помилки, приберемо всі дурниці, перефразуємо невдалі місця, але сильно текст не переписуватимемо. Зайвих виправлень не буде. Виправимо всі помилки, приберемо всі дурниці, перефразуємо невдалі місця, але сильно текст не переписуватимемо. Зайвих виправлень не буде. Виправимо всі помилки, приберемо всі дурниці, перефразуємо невдалі місця, але сильно текст не переписуватимемо. Зайвих виправлень не буде. Виправимо всі помилки, приберемо всі дурниці, перефразуємо невдалі місця, але сильно текст не переписуватимемо. Зайвих виправлень не буде. Виправимо всі помилки, приберемо всі дурниці, перефразуємо невдалі місця, але сильно текст не переписуватимемо. Зайвих виправлень не буде. Виправимо всі помилки, приберемо всі дурниці, перефразуємо невдалі місця, але сильно текст не переписуватимемо. Зайвих виправлень не буде. Виправимо всі помилки, приберемо всі дурниці, перефразуємо невдалі місця, але силь'
let text920 = 'Виправимо всі помилки, приберемо всі дурниці, перефразуємо невдалі місця, але сильно текст не переписуватимемо. Зайвих виправлень не буде. Виправимо всі помилки, приберемо всі дурниці, Виправимо всі помилки, приберемо всі дурниці, перефразуємо невдалі місця, але сильно текст не переписуватимемо. Зайвих виправлень не буде. Виправимо всі помилки, приберемо всі дурниці, Виправимо всі помилки, приберемо всі дурниці, перефразуємо невдалі місця, але сильно текст не переписуватимемо. Зайвих виправлень не буде. Виправимо всі помилки, приберемо всі дурниці, Виправимо всі помилки, приберемо всі дурниці, перефразуємо невдалі місця, але сильно текст не переписуватимемо. Зайвих виправлень не буде. Виправимо всі помилки, приберемо всі дурниці, Виправимо всі помилки, приберемо всі дурниці, Виправимо всі помилки, приберемо всі дурниці, Виправимо всі помилки, приберемо всі дурниці, Виправимо всі помилки, приберемо всі дурни'

const languages = {
  RU: 0.05,
  UA: 0.05,
  EN: 0.12
}
const typeOfFile = ['.doc', '.docx', '.rtf'];
const MIN_RU_UKR_COST = 50;
const MIN_EN_COST = 120;
const SYMBOLS_RU_UKR_PER_HOUR = 1333;
const SYMBOLS_EN_PER_HOUR = 333;
const RISING_PRICE_PERCENT = 20;
// const ORDER_PROCESSING_TIME_IN_MIN = 30;

// find total cost for redactiong text
function calcTextEditCost(text, type = '.docx', lang) {
  let cost_per_symbols,
    minCost,
    totalCost

  lang === 'EN' ? minCost = MIN_EN_COST : minCost = MIN_RU_UKR_COST

  if (typeOfFile.some(basicType => basicType === type)) {
    cost_per_symbols = languages[lang]
  } else {
    cost_per_symbols = Number((languages[lang] + languages[lang] * RISING_PRICE_PERCENT / 100).toFixed(4))
  }

  console.log(cost_per_symbols)

  if (text.length * cost_per_symbols < minCost) {
    totalCost = minCost
  } else {
    totalCost = text.length * cost_per_symbols
  }

  return Math.ceil(totalCost) // нужно ли округлять копейки к гривням? я округлила
}

console.log(calcTextEditCost(text920, '.docx', 'RU'))

const MIN_HOURS_PER_ORDER = 1
// function calcHours

// function calcDate
// const HOURS_PER_DAY = 8
// if (!!hours_per_symbols) {
